---
kind: property
id: P:Autodesk.Revit.DB.CategorySet.Size
source: html/d68486a0-58d0-4457-f46f-5ef90042d520.htm
---
# Autodesk.Revit.DB.CategorySet.Size Property

Returns the number of categories that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```